[
  {
    "name": "The Trading Game: A Confession",
    "author": "Gary Stevenson",
    "rating": "🟩",
    "thoughts": "I've readlly enjoyed his Youtube channel \"Gary's Economis\" for a while now. In that light I was slightly disappointed that the book was mostly biographic, with not a whole lot of economics. That said, Stevensen is a REALLY great writer. Lots of very funny anecdotes, and insights. Worth the read.",
    "date": "2025-03",
    "fiction": false,
    "coverImg": "/Assets/book-covers/tradingGame.jpg"
  },

  {
    "name": "The Three-Body Problem",
    "author": "Liu Cixin",
    "rating": "⭐",
    "thoughts": "I never thought I would take \"Astro-socialogy\" as a serious concept before reading this. Read the whole series, seriously.",
    "date": "2023-08",
    "fiction": true,
    "coverImg": "/Assets/book-covers/three-body-problem.jpg"
  },
  {
    "name": "The Village Teacher",
    "author": "Liu Cixin",
    "rating": "⭐",
    "thoughts": "Cixin does not miss. This short graphic novel which I read in an hour hit me like a sledgehammer with its final panel. Teachers are amazing. Go thank your nearest teacher.",
    "date": "2025-03",
    "fiction": true,
    "coverImg": "/Assets/book-covers/theVillageTeacher.jpg"
  },
  {
    "name": "Technofeudalism: What Killed Capitalism",
    "author": "Yanis Varoufakis",
    "rating": "⭐",
    "thoughts": "Varoufakis is a surprisingly great writer. The first chapter draws an extremely compelling extended metaphor between physics and philosphy and economics which blew me away. His core thesis is that we have moved beyond capitalism, and far from the socialist utopia which many predicted would be the downfall of capitalism, we ended up with something weird, and worse than capitalism. Very compelling read, and one of the more influential in how I currently percieve the world economy.",
    "date": "2025-03",
    "fiction": false,
    "coverImg": "/Assets/book-covers/Technofeudalism.jpg"
  },
  {
    "name": "How to Predict the Unpredictable The Art of Outsmarting Almost Everyone",
    "author": "William Poundstone",
    "rating": "🟩",
    "thoughts": "This one was really good. The central premise is that humans are really bad at true randomness, and we fall into very predicatble patterns while trying to do random. The book then outlines the mistakes we tend to make (and practical advice in how you could exploit those blindspots)",
    "date": "2024-08",
    "fiction": false,
    "coverImg": "/Assets/book-covers/predictTheUnpredictable.jpg"
  },
  {
    "name": "Dune",
    "author": "Frank Herbert",
    "rating": "🟩",
    "thoughts": "I read Dune, and Dune Messiah where it got a bit too weird. The original is where it is at. The book is at its most interesting when it is talking about real politik. ",
    "date": "2023-01",
    "fiction": true,
    "coverImg": "/Assets/book-covers/dune.jpg"
  }
]