[
  {
    "name": "I Spy: My life in MI5",
    "author": "Tom Marcus",
    "rating": "🟧",
    "thoughts": "Fair warning, this is straight up propaganda (it even had to pass MI5 clearance to publish) and is written like Tom Clancy. Nonetheless, it was really enjoyable to read. The narrative of it is mostly in the form of radio chatter which is a form I personally find gripping. Also kind of terrrifying to think how many terror plots get stopped, but it restored some level of my faith in instituitions to see the principaled stance that Tom and his team operated within.",
    "date": "2025-08",
    "fiction": false,
    "coverImg": "/Assets/book-covers/ispy.jpg"
  },
  {
    "name": "Snake Island ",
    "author": "Ben Hobson",
    "rating": "🟩",
    "thoughts": "The review they stick in the front describes it as \"Part western, part Greek tragedy\" and I think that is a really good description. The story is very Australian, but not in a cheap way, and all the characters are fascinating. I don't read a lot of fiction and even less \"literaqture\" but this was really enjoyable",
    "date": "2025-08",
    "fiction": true,
    "coverImg": "/Assets/book-covers/snakeisland.jpg"
  },
  {
    "name": "No Power Greater: A History of Union Action in Australia",
    "author": "Liam Byrne",
    "rating": "🟧",
    "thoughts": "A bit of a slog to get through to be completely honest, but also incredibly important. The book tells the story of Australia through the lens of union action. Turns out almost all the institutions I like were thanks to unions. If you have ever said the words \"Bob Hawke and Keating were Neoliberals\" you should read this book to understand how that period of history really worked",
    "date": "2025-07",
    "fiction": false,
    "coverImg": "/Assets/book-covers/NoPowerGreater.jpg"
  },
  {
    "name": "the happiness of dogs: why the unexamined life is the most worth living",
    "author": "Mark Rowlands",
    "rating": "🟩",
    "thoughts": "this was a very accessible book on philosophy, i have previsoly struggled with a lot of \"traditional\" philosphy, e.g. netzsche and camus which who i've attempted to read several times and keep bouncing off. admittedly, when i picked it up i was expecting a self-help book, turns out it was a philosophy of mind book. very worthwile anyway.",
    "date": "2025-06",
    "fiction": false,
    "coverImg": "/Assets/book-covers/happinessOfDogs.jpg"
  },
  {
    "name": "Blindsight",
    "author": "Peter Watts",
    "rating": "⭐",
    "thoughts": "Blindsight falls into the club with the Matrix and the Three Body Problem, of being a piece of Sci-Fi who is primarily a piece of philosophy. It is a ***crunchy*** bit of sci-fi which explores transhumanism more thoroughly than any other piece I can think of. I have more thoughts which I will save for an extended blogpost I think. ",
    "date": "2025-05",
    "fiction": true,
    "coverImg": "/Assets/book-covers/blindsight.jpg"
  },
  {
    "name": "Conflict: the evolution of warfare from 1945 to Gaza",
    "author": "General David Petraeus and Andrew Roberts",
    "rating": "🟧",
    "thoughts": "This is a complicated one to recommend. It was a bit of a slog to read, and parts of it were quite confronting. Without going too much into my own political ideology, I don't think it would be that surprising to most that I do not agree 100% with the political opinions espoused by a general of the U.S military. That said, I do think it is worth a read. Not because I agree with all the opinions of the author, but because I think it is very important for many to understand how a general of the U.S. military thinks.",
    "date": "2025-04",
    "fiction": false,
    "coverImg": "/Assets/book-covers/Conflict.jpg"
  },
  {
    "name": "The Trading Game: A Confession",
    "author": "Gary Stevenson",
    "rating": "🟩",
    "thoughts": "I've readlly enjoyed his Youtube channel \"Gary's Economis\" for a while now. In that light I was slightly disappointed that the book was mostly biographic, with not a whole lot of economics. That said, Stevensen is a REALLY great writer. Lots of very funny anecdotes, and insights. Worth the read.",
    "date": "2025-03",
    "fiction": false,
    "coverImg": "/Assets/book-covers/tradingGame.jpg"
  },
  {
    "name": "The Three-Body Problem",
    "author": "Liu Cixin",
    "rating": "⭐",
    "thoughts": "I never thought I would take \"Astro-socialogy\" as a serious concept before reading this. Read the whole series, seriously.",
    "date": "2023-08",
    "fiction": true,
    "coverImg": "/Assets/book-covers/three-body-problem.jpg"
  },
  {
    "name": "Laziness does not exist: A defense of the exhausted, exploited, and overworked",
    "author": "Devon Price",
    "rating": "🟧",
    "thoughts": "I found this to be less interesting than I hoped. Yep, if you work too hard you will burn out, and there are physiological signs. Idk, maybe some people need a book to tell them this.",
    "date": "2025-02",
    "fiction": false,
    "coverImg": "/Assets/book-covers/lazinessdoesnotexist.jpg"
  },
  {
    "name": "The Village Teacher",
    "author": "Liu Cixin",
    "rating": "⭐",
    "thoughts": "Cixin does not miss. This short graphic novel which I read in an hour hit me like a sledgehammer with its final panel. Teachers are amazing. Go thank your nearest teacher.",
    "date": "2025-03",
    "fiction": true,
    "coverImg": "/Assets/book-covers/theVillageTeacher.jpg"
  },
  {
    "name": "Technofeudalism: What Killed Capitalism",
    "author": "Yanis Varoufakis",
    "rating": "⭐",
    "thoughts": "Varoufakis is a surprisingly great writer. The first chapter draws an extremely compelling extended metaphor between physics and philosphy and economics which blew me away. His core thesis is that we have moved beyond capitalism, and far from the socialist utopia which many predicted would be the downfall of capitalism, we ended up with something weird, and worse than capitalism. Very compelling read, and one of the more influential in how I currently percieve the world economy.",
    "date": "2025-03",
    "fiction": false,
    "coverImg": "/Assets/book-covers/Technofeudalism.jpg"
  },
  {
    "name": "How to Predict the Unpredictable The Art of Outsmarting Almost Everyone",
    "author": "William Poundstone",
    "rating": "🟩",
    "thoughts": "This one was really good. The central premise is that humans are really bad at true randomness, and we fall into very predicatble patterns while trying to do random. The book then outlines the mistakes we tend to make (and practical advice in how you could exploit those blindspots)",
    "date": "2024-08",
    "fiction": false,
    "coverImg": "/Assets/book-covers/predictTheUnpredictable.jpg"
  },
  {
    "name": "Bloom",
    "author": "Ruth Kassinger",
    "rating": "⭐",
    "thoughts": "This book is GREAT. It had me absolutley obsessed with a topic I previously knew nothing about. The book is covers the bilogoy, ecology and biotechnology of algea. It somehow had me turning pages faster I could have possibly thought given the topic. By the end I was obsessed and looking at ingredients on the back of boxes to identify the algal products inside.",
    "date": "2024-12",
    "fiction": false,
    "coverImg": "/Assets/book-covers/bloom.jpg"
  },
  {
    "name": "War & Peace & War: 20 Years In Afghanistan",
    "author": "Andrew North",
    "rating": "🟩",
    "thoughts": "I really liked this one. It is a history of the last 20 years in Afghanistan, told biographically through the eyes of the authors collegues. This method of history is deeply personal, and I think an illuminating way to personally understand WHY things happened how they did in a sociological context.",
    "date": "2024-10",
    "fiction": false,
    "coverImg": "/Assets/book-covers/warandpeaceandwar.jpg"
  },
  {
    "name": "The Internet Con: How to seize the means of computation",
    "author": "Cory Doctorow",
    "rating": "⭐",
    "thoughts": "Typically I am a very materialist (philosophically, not literally) person, and as a results this was one of the more impactful political books I have ever read. In many cases power is downstream from technology, and Doctorow expertly identifies the problems, their causes and their solutions. More than any other pice, this is a guidebook for the necessary changes to affect downstream changes.",
    "date": "2024-07",
    "fiction": false,
    "coverImg": "/Assets/book-covers/theinternetcon.jpg"
  },
  {
    "name": "Froth: The Science of Beer",
    "author": "Mark Dredge",
    "rating": "🟩",
    "thoughts": "Of all the books I've read about beer (3) this remains my favourite. Probably because it was written by a physicist.",
    "date": "2023-10",
    "fiction": false,
    "coverImg": "/Assets/book-covers/froth.jpg"
  },
  {
    "name": "Dune",
    "author": "Frank Herbert",
    "rating": "🟩",
    "thoughts": "I read Dune, and Dune Messiah where it got a bit too weird. The original is where it is at. The book is at its most interesting when it is talking about real politik. ",
    "date": "2023-01",
    "fiction": true,
    "coverImg": "/Assets/book-covers/dune.jpg"
  },
  {
    "name": "For the benefit of mankind",
    "author": "Liu Cixin",
    "rating": "⭐",
    "thoughts": "Cixin Liu did that really cool thing where he managed to thread the needle between a scathing critique of capital, while also criticising a reactionary authoritarian communist attempt at redistribution",
    "date": "2025-02",
    "fiction": true,
    "coverImg": "/Assets/book-covers/benefitofmankind.jpg"
  },
  {
    "name": "Everything Is Tuberculosis",
    "author": "John Green",
    "rating": "🟩",
    "thoughts": "I never read John Green's YA fiction, since I was not a \"YA\" when I first came across it, BUT, I absolutely adored Crash Course History, and the way John thinks on Vlog Brothers. With this in mind, \"Everything is Tuberculosis\" is everything I hoped for. He places the diseases in the context of human history and present day human culture. He ends the book arguing that Tuberculosis used to be caused by bacterial infection, now it is caused by injustice, and it is our job to fix it.",
    "date": "2025-08",
    "fiction": false,
    "coverImg": "/Assets/book-covers/978-0-525-42605-9.jpg"
  },
  {
    "name": "In Ascension",
    "author": "Martin MacInnes",
    "rating": "🟩",
    "thoughts": "A surprisingly humanist piece of Sci-Fi. This piece manages to both be both VERY accurate in the science, yet mostly interested in the humanity of is characters",
    "date": "2024-10",
    "fiction": true,
    "coverImg": "/Assets/book-covers/978-1--83895-624-0.jpg"
  }
]